Microchip-MPLAB-Harmony/dev_packs/Microchip/SAML22_DFP/3.4.59/edc/ATSAML22N18A.PIC
      <edc:SFRDef edc:_addr="0xE000ED9C" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="RBAR" edc:nzwidth="0x20" ltx:memberofperipheral="MPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="REGION" edc:desc="Region number" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="VALID" edc:desc="Region number valid" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="Region base address" edc:nzwidth="0x1B"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000EDA0" edc:access="---n-nnn--nnnnnnnnnnnnnn--nnnnnn" edc:cname="RASR" edc:impl="0x173FFF3F" edc:nzwidth="0x20" ltx:memberofperipheral="MPU">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="MPU">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Region Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SIZE" edc:desc="Region Size" edc:nzwidth="0x5"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SRD" edc:desc="Sub-region disable" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="B" edc:desc="Bufferable bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="C" edc:desc="Cacheable bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="S" edc:desc="Shareable bit" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEX" edc:desc="TEX bit" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="AP" edc:desc="Access Permission" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="XN" edc:desc="Execute Never Attribute" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0xE000E000" edc:endaddr="0xE000F000" edc:regionid="SCS" edc:rw="rw"/>
    <edc:SFRDataSector edc:beginaddr="0x40000000" edc:endaddr="0x42004818" edc:regionid="PERIPHERALS" edc:rw="rw">
      <edc:SFRDef edc:_addr="0x40000000" edc:access="--------nnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="WRCTRL" edc:impl="0xFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="PERID" edc:desc="Peripheral identifier" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="KEY" edc:desc="Peripheral access control key" edc:nzwidth="0x8">
              <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="No action" edc:when="(field &amp; 0xFF) == 0"/>
              <edc:SFRFieldSemantic edc:cname="CLR" edc:desc="Clear protection" edc:when="(field &amp; 0xFF) == 1"/>
              <edc:SFRFieldSemantic edc:cname="SET" edc:desc="Set protection" edc:when="(field &amp; 0xFF) == 2"/>
              <edc:SFRFieldSemantic edc:cname="SETLCK" edc:desc="Set and lock protection" edc:when="(field &amp; 0xFF) == 3"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000004" edc:access="-------n" edc:cname="EVCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="ERREO" edc:desc="Peripheral acess error event output" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40000005" edc:offset="0x3"/>
      <edc:SFRDef edc:_addr="0x40000008" edc:access="-------n" edc:cname="INTENCLR" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="ERR" edc:desc="Peripheral access error interrupt disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000009" edc:access="-------n" edc:cname="INTENSET" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="ERR" edc:desc="Peripheral access error interrupt enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4000000A" edc:offset="0x6"/>
      <edc:SFRDef edc:_addr="0x40000010" edc:access="-------------------------nnnnnnn" edc:cname="INTFLAGAHB" edc:impl="0x7F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="FLASH_" edc:desc="FLASH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HSRAMCM0P_" edc:desc="HSRAMCM0P" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HSRAMDSU_" edc:desc="HSRAMDSU" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HPB1_" edc:desc="HPB1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HPB0_" edc:desc="HPB0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HPB2_" edc:desc="HPB2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HSRAMDMAC_" edc:desc="HSRAMDMAC" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000014" edc:access="--------------------nnnnnnnnnnnn" edc:cname="INTFLAGA" edc:impl="0xFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="PAC_" edc:desc="PAC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PM_" edc:desc="PM" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCLK_" edc:desc="MCLK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTC_" edc:desc="RSTC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCCTRL_" edc:desc="OSCCTRL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSC32KCTRL_" edc:desc="OSC32KCTRL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SUPC_" edc:desc="SUPC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GCLK_" edc:desc="GCLK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDT_" edc:desc="WDT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTC_" edc:desc="RTC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIC_" edc:desc="EIC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FREQM_" edc:desc="FREQM" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000018" edc:access="--------------------------nnnnnn" edc:cname="INTFLAGB" edc:impl="0x3F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="USB_" edc:desc="USB" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSU_" edc:desc="DSU" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NVMCTRL_" edc:desc="NVMCTRL" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PORT_" edc:desc="PORT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMAC_" edc:desc="DMAC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MTB_" edc:desc="MTB" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4000001C" edc:access="-------------nnnnnnnnnnnnnnnnnnn" edc:cname="INTFLAGC" edc:impl="0x7FFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="EVSYS_" edc:desc="EVSYS" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM0_" edc:desc="SERCOM0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM1_" edc:desc="SERCOM1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM2_" edc:desc="SERCOM2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM3_" edc:desc="SERCOM3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM4_" edc:desc="SERCOM4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SERCOM5_" edc:desc="SERCOM5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCC0_" edc:desc="TCC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC0_" edc:desc="TC0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC1_" edc:desc="TC1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC2_" edc:desc="TC2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC3_" edc:desc="TC3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ADC_" edc:desc="ADC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AC_" edc:desc="AC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PTC_" edc:desc="PTC" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SLCD_" edc:desc="SLCD" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AES_" edc:desc="AES" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRNG_" edc:desc="TRNG" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CCL_" edc:desc="CCL" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x40000020" edc:offset="0x14"/>
      <edc:SFRDef edc:_addr="0x40000034" edc:access="--------------------rrrrrrrrrrrr" edc:cname="STATUSA" edc:impl="0xFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="PAC_" edc:desc="PAC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PM_" edc:desc="PM APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MCLK_" edc:desc="MCLK APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTC_" edc:desc="RSTC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSCCTRL_" edc:desc="OSCCTRL APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OSC32KCTRL_" edc:desc="OSC32KCTRL APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SUPC_" edc:desc="SUPC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GCLK_" edc:desc="GCLK APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDT_" edc:desc="WDT APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTC_" edc:desc="RTC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIC_" edc:desc="EIC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FREQM_" edc:desc="FREQM APB Protect Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x40000038" edc:access="--------------------------rrrrrr" edc:cname="STATUSB" edc:impl="0x3F" edc:mclr="00000000000000000000000000000010" edc:nzwidth="0x20" edc:por="00000000000000000000000000000010" ltx:memberofperipheral="PAC">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="PAC">
            <edc:SFRFieldDef edc:cname="USB_" edc:desc="USB APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSU_" edc:desc="DSU APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NVMCTRL_" edc:desc="NVMCTRL APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PORT_" edc:desc="PORT APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMAC_" edc:desc="DMAC APB Protect Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MTB_" edc:desc="MTB APB Protect Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
